app/controllers/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins"
---
  def index
    @bulletins = Bulletin.all

INSERT INTO "bulletins" ("title", "description", "post_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "소주"], ["description", "소주"], ["post_type", "store"], ["created_at", "2015-06-03 13:23:14.204178"], ["updated_at", "2015-06-03 13:23:14.204178"]]
---
  def create
    @bulletin = Bulletin.new(bulletin_params)

    respond_to do |format|
      if @bulletin.save

UPDATE "bulletins" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "bulletins"."id" = ?  [["title", "Q&A11"], ["description", "Q&A11"], ["updated_at", "2015-06-14 23:04:28.014855"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @bulletin.update(bulletin_params)

SELECT  "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_bulletin
      @bulletin = Bulletin.find(params[:id])