app/controllers/posts_controller.rb

  def index
    @posts = @bulletin.posts.all
    @products = Product.order(:title)
---
SELECT "posts".* FROM "posts" WHERE "posts"."bulletin_id" = ?  [["bulletin_id", 1]]
SELECT "products".* FROM "products"  ORDER BY "products"."title" ASC

  def create
    @post = @bulletin.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "bulletin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "배송 언제되죠"], ["content", "겁나게안옴 ㅜㅜ"], ["bulletin_id", 4], ["created_at", "2015-06-04 08:20:16.747918"], ["updated_at", "2015-06-04 08:20:16.747918"]]

    def set_bulletin
      @bulletin = Bulletin.find(params[:bulletin_id])
---
SELECT  "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", 5]]

    def set_post
      @post = @bulletin.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."bulletin_id" = ? AND "posts"."id" = ? LIMIT 1  [["bulletin_id", 5], ["id", 2]]