app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "스미노프 그린애플 700ml"], ["description", "· 원산지 : 미국 <br>\r\n· 용량 : 700ml\r\n· 알콜도수 : 35%"], ["price", 26000.0], ["updated_at", "2015-06-03 03:43:25.868914"], ["id", 1]]